---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.FailedToReadLine
source: html/5274105a-844f-c0eb-f93c-3f0218f8a87c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeneralFailures.FailedToReadLine Property

Failed to read line.

## Syntax (C#)
```csharp
public static FailureDefinitionId FailedToReadLine { get; }
```